在终端中输入vimtutor即可进入此教程
第一讲：
 1. 光標在屏幕文本中的移動既可以用箭頭鍵，也可以使用 hjkl 字母鍵。
         h (左移)       j (下行)       k (上行)     l (右移)

  2. 欲進入vim編輯器(從命令行提示符)，請輸入︰vim 文件名 <回車>

  3. 欲退出vim編輯器，請輸入以下命令放棄所有修改︰

        <ESC>   :q!      <回車>

     或者輸入以下命令保存所有修改︰

        <ESC>   :wq      <回車>

  4. 在正常模式下刪除光標所在位置的字符，請按︰ x

  5. 在正常模式下要在光標所在位置開始插入文本，請按︰

         i     輸入必要文本     <ESC>
第二讲


  1. 欲從當前光標刪除至單字/單詞末尾，請輸入︰dw

  2. 欲從當前光標刪除至當前行末尾，請輸入︰d$

  3. 欲刪除整行，請輸入︰dd

  4. 在正常模式下一個命令的格式是︰

       [number]   command   object     或者     command [number]   object
     其意是︰
       number - 代表的是命令執行的次數
       command - 代表要做的事情，比如 d 代表刪除
       object - 代表要操作的對象，比如 w 代表單字/單詞，$ 代表到行末等等。
                $ (to the end of line), etc.

  5. 欲撤消以前的操作，請輸入︰u (小寫的u)
     欲撤消在一行中所做的改動，請輸入︰U (大寫的U)
     欲撤消以前的撤消命令，恢復以前的操作結果，請輸入︰CTRL-R
第三讲


  1. 要重新置入已經刪除的文本內容，請輸入小寫字母 p。該操作可以將已刪除
     的文本內容置于光標之後。如果最後一次刪除的是一個整行，那麼該行將置
     于當前光標所在行的下一行。

  2. 要替換光標所在位置的字符，請輸入小寫的 r 和要替換掉原位置字符的新字
     符即可。

  3. 更改類命令允許您改變指定的對象，從當前光標所在位置直到對象的末尾。
     比如輸入 cw 可以替換當前光標到單詞的末尾的內容；輸入 c$ 可以替換當
     前光標到行末的內容。

  4. 更改類命令的格式是︰

         [number]   c   object        或者      c   [number]   object
第四讲
第四講小結


  1. Ctrl-g 用于顯示當前光標所在位置和文件狀態信息。Shift-G 用于將光標跳
     轉至文件最後一行。先敲入一個行號然後按 Shift-G 則是將光標移動至該行
     號代表的行。

  2. 輸入 / 然後緊隨一個字符串是則是在當前所編輯的文檔中向後查找該字符串。
     輸入問號 ? 然後緊隨一個字符串是則是在當前所編輯的文檔中向前查找該字
     符串。完成一次查找之後按 n 鍵則是重復上一次的命令，可在同一方向上查
     找下一個字符串所在；或者按 Shift-N 向相反方向查找下該字符串所在。

  3. 如果光標當前位置是括號(、)、[、]、{、}，按 % 可以將光標移動到配對的
     括號上。

  4. 在一行內替換頭一個字符串 old 為新的字符串 new，請輸入  :s/old/new
     在一行內替換所有的字符串 old 為新的字符串 new，請輸入  :s/old/new/g
     在兩行內替換所有的字符串 old 為新的字符串 new，請輸入  :#,#s/old/new/g
     在文件內替換所有的字符串 old 為新的字符串 new，請輸入  :%s/old/new/g
     進行全文替換時詢問用戶確認每個替換需添加 c 選項，請輸入 :%s/old/new/gc

第五讲
1. :!command 用于執行一個外部命令 command。

     請看一些實際例子︰
         :!dir          -  用于顯示當前目錄的內容。
         :!rm FILENAME  -  用于刪除名為 FILENAME 的文件。

  2. :w FILENAME  可將當前 VIM 中正在編輯的文件保存到名為 FILENAME
     的文件中。

  3. :#,#w FILENAME 可將當前編輯文件第 # 行至第 # 行的內容保存到文件
     FILENAME 中。

  4. :r FILENAME 可提取磁盤文件 FILENAME 並將其插入到當前文件的光標位置
     後面。
第六讲
1. 輸入小寫的 o 可以在光標下方打開新的一行並將光標置于新開的行首，進入
     插入模式。
     輸入大寫的 O 可以在光標上方打開新的一行並將光標置于新開的行首，進入
     插入模式。

  2. 輸入小寫的 a 可以在光標所在位置之後插入文本。
     輸入大寫的 A 可以在光標所在行的行末之後插入文本。

  3. 輸入大寫的 R 將進入替換模式，直至按 <ESC> 鍵退出替換模式而進入正常
     模式。

  4. 輸入 :set xxx 可以設置 xxx 選項。
